app/controllers/cards_controller.rb

SELECT "cards".* FROM "cards" WHERE "cards"."deck_id" = $1  [["deck_id", 6]]
---
  def index
    @cards = @deck.cards.all

INSERT INTO "cards" ("prompt_text", "prompt_image", "prompt_audio", "answer", "created_at", "updated_at", "deck_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["prompt_text", "dfds"], ["prompt_image", ""], ["prompt_audio", ""], ["answer", "fdsfs"], ["created_at", 2016-08-08 05:03:22 UTC], ["updated_at", 2016-08-08 05:03:22 UTC], ["deck_id", 6]]
---
  def create
    @card = @deck.cards.new(card_params)

    if @card.save

UPDATE "cards" SET "prompt_text" = $1, "updated_at" = $2 WHERE "cards"."id" = $3  [["prompt_text", "hi"], ["updated_at", 2016-08-08 08:34:01 UTC], ["id", 6]]
---
  def update
    if @card.update(card_params)

DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 8]]
---
  def destroy
    @card.destroy

SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def set_deck
    @deck = Deck.find(params[:deck_id])

SELECT  "cards".* FROM "cards" WHERE "cards"."deck_id" = $1 AND "cards"."id" = $2 LIMIT $3  [["deck_id", 15], ["id", 22], ["LIMIT", 1]]
---
  def set_card
    @card = @deck.cards.find(params[:id])