app/controllers/decks_controller.rb

SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "root"], ["LIMIT", 1]]
---
  def index

    # @decks = Deck.all.order("created_at ASC")
    @decks = Deck.where(user_id: params[:username]) || Deck.where(user_id: current_user)

    if params[:username].present?
      @user = User.find_by(username: params[:username])

INSERT INTO "decks" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "testing my user"], ["description", "gjnvc'  fddf"], ["created_at", 2016-08-07 18:24:47 UTC], ["updated_at", 2016-08-07 18:24:47 UTC], ["user_id", 2]]
---
  def create
    @deck = current_user.decks.build(deck_params)

    if @deck.save

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Root"], ["LIMIT", 1]]
---
  def show
    if params[:username].present?
      @user = User.find_by(username: params[:username])

UPDATE "decks" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "decks"."id" = $4  [["title", "A deck for you"], ["description", "My love"], ["updated_at", 2016-08-10 14:53:14 UTC], ["id", 14]]
---
  def update
    if current_user.id != @deck.user.id
      return redirect_to @deck
    end

    if @deck.update(deck_params)

DELETE FROM "decks" WHERE "decks"."id" = $1  [["id", 2]]
---
  def destroy
    if current_user.id != @deck.user.id
      return redirect_to @deck
    end

    @deck.destroy

SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def find_deck
	  @deck = Deck.find(params[:id])