app/controllers/decks_controller.rb

SELECT "decks".* FROM "decks" ORDER BY created_at DESC
---
  def index
    @decks = Deck.all.order("created_at DESC")