app/views/decks/show.html.erb

SELECT "cards".* FROM "cards" WHERE "cards"."deck_id" = $1  [["deck_id", 6]]
---

      <% @deck.cards.each do |card| %>